export const COLLEGE_GROUPS = {
  "111": {
    "group": "111",
    "course": 1,
    "base": "11 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8 / Дідріхсона, 13",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "111-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Теорія та будова судна",
            "room": "501",
            "teacher": "Александровська Н.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика та основи технічної механіки",
            "room": "104",
            "teacher": "Чеботар Р.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Навігація і лоція",
            "room": "каб/нав",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "111-mon-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика та основи технічної механіки",
            "room": "104",
            "teacher": "Чеботар Р.Г.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "111-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика",
            "room": "402",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Англійська мова (за проф.спрямуванням0",
            "room": "310",
            "teacher": "Кулікова І.Я",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "111-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Основи правознавства",
            "room": "103",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика",
            "room": "402",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": "103",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "111-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Океанські шляхи світу",
            "room": "214",
            "teacher": "Корончук В.Ю.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Основи економічної теорії",
            "room": "502",
            "teacher": "Віннічук М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "111-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Англійська мова (за професійним спрямуванням)",
            "room": "311",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Навігація і лоція",
            "room": "каб.нав.",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика та основи технічної механіки",
            "room": "104",
            "teacher": "Чеботар Р.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "121": {
    "group": "121",
    "course": 2,
    "base": "11 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8 / Дідріхсона, 13",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "121-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Теорія та будова судна",
            "room": "316",
            "teacher": "Сєргєєв В.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "121-mon-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Метеорологія і океанографія",
            "room": "каб/нав",
            "teacher": "Юхименко М.Г.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "121-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Навігація і лоція",
            "room": "каб/нав",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Управління судном",
            "room": "316",
            "teacher": "Райнов О.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "121-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Основи національного спротиву",
            "room": "312",
            "teacher": "Орешенко В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Метеорологія і океанографія",
            "room": "каб/нав",
            "teacher": "Юхименко М.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Електронавігаційні прилади",
            "room": "312",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "121-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Радіотехніка і електроніка",
            "room": "314",
            "teacher": "Пихтєєв О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Основи філософських знань",
            "room": "103",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Теорія та будова судна",
            "room": "314",
            "teacher": "Сергєєв В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформаційні технології",
            "room": "219п",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "121-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізичне виховання Луговський А.П..",
            "room": "С/З",
            "teacher": "",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Комерційна експлуатація суден",
            "room": "302",
            "teacher": "Гришина Ю.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "121-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Безпека та охорона на морі",
            "room": "316",
            "teacher": "Шелест В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Безпека та охорона на морі",
            "room": "316",
            "teacher": "Шелест В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Основи національного спротиву",
            "room": "314",
            "teacher": "Орешенко В.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "121-fri-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Англійська мова (за проф.спрям.)",
            "room": "311",
            "teacher": "Кулікова І.Я.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "211": {
    "group": "211",
    "course": 1,
    "base": "11 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8 / Дідріхсона, 13",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "211-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізичне виховання",
            "room": "корп.2",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Культурологія",
            "room": "корп.2",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Теорія, будова судна та рушії",
            "room": "корп.2",
            "teacher": "Александровська Н.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Теорія, будова судна та рушії",
            "room": "корп.2",
            "teacher": "Александровська Н.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "211-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Технологія матеріалів",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика",
            "room": "корп.2",
            "teacher": "Мельников О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "корп.2",
            "teacher": "Чеботар Р.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "211-tue-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика",
            "room": "корп.2",
            "teacher": "Мельников О.С.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "211-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Основи гідромеханіки",
            "room": "корп.2",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Англійська мова (за проф. спрямуванням)",
            "room": "корп.2",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Електротехніка та основи електроніки",
            "room": "корп.2",
            "teacher": "Демиденко О.Д.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "211-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Основи технічної термодинаміки та теплопередачі",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика",
            "room": "корп.2",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "211-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Технічна механіка (Теоретична механіка, Опір матеріалів, Деталі машин)",
            "room": "корп.2",
            "teacher": "Чеботар Р.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Суднові дизельні установки",
            "room": "корп.2",
            "teacher": "Туснахов О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "221": {
    "group": "221",
    "course": 2,
    "base": "11 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8 / Дідріхсона, 13",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "221-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Англійська мова (за проф. спрямування)",
            "room": "корп.2",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізичне виховання",
            "room": "корп.2",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Англійська мова (за проф. спрямування)",
            "room": "корп.2",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "221-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Електрообладнання суден",
            "room": "корп.2",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Технічна механіка (теоретична механіка, опір матеріалів, деталі машин)",
            "room": "корп.2",
            "teacher": "Чеботар Р.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "221-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Суднові допоміжні механізми, устрої та системи",
            "room": "корп.2",
            "teacher": "Очеретяний Ю.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Основи автоматики",
            "room": "корп.2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "221-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Суднові котельні установки",
            "room": "корп.2",
            "teacher": "Бондар С.А.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "221-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Суднові турбінні установки",
            "room": "корп.2",
            "teacher": "Туснахов О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Суднові допоміжні механізми, устрої та системи",
            "room": "корп.2",
            "teacher": "Очеретяний Ю.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Основи національнеого спротиву",
            "room": "корп.2",
            "teacher": "Сєргєєв В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Електротехніка та основи електроніки",
            "room": "корп.2",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "221-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Суднові дизельні установки",
            "room": "корп.2",
            "teacher": "Туснахов О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова (за професійнис спрямуванням)",
            "room": "корп.2",
            "teacher": "Коваль Л.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Електротехніка та основи електроніки",
            "room": "корп.2",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "221-fri-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Основи національного спротиву",
            "room": "корп.2",
            "teacher": "Сєргєєв В.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "221-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "корп.2",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "421": {
    "group": "421",
    "course": 2,
    "base": "11 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8 / Дідріхсона, 13",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "421-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Устрій та основи теорії суден",
            "room": ".004",
            "teacher": "Шевченко О.Т.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Двигуни внутрішнього згоряння ППМ",
            "room": ".004",
            "teacher": "Ремінь А.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "421-mon-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Гідро- та пневмо приводи ППМ",
            "room": ".004",
            "teacher": "Ремінь А.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "421-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Електрообладнання портових перевантажувальних машин",
            "room": ".005",
            "teacher": "Чебан А.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Англійська мова (за проф. спрямуванням)",
            "room": "309",
            "teacher": "Сабенгуз С.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "421-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Основи національного спроьтву",
            "room": ".004",
            "teacher": "Ремінь А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова (за професійним спрямуванням0",
            "room": "212",
            "teacher": "Коваль Л.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Експлуатація, ремонт та монтаж ППМ",
            "room": ".005",
            "teacher": "Чебан А.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "421-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Портові перевантажувальні машини",
            "room": ".004",
            "teacher": "Кокошко Є.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "421-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Технологія та механізація ПР",
            "room": "214",
            "teacher": "Малікова О.А.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "421-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Основи електроніки",
            "room": "323п",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Устрій морських портів",
            "room": "214",
            "teacher": "Сушенцова Г.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "421-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформаційні технології",
            "room": "219П",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Устрій морських портів",
            "room": "214",
            "teacher": "Сушенцова Г.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Технічна механіка (теоретична механіка, опір матеріалів, деталі машин)",
            "room": ".008",
            "teacher": "Мельников О.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "421-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Двигуни внутрішнього згоряння портових перевантажувальних машин",
            "room": ".004",
            "teacher": "Ремінь А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Небож І.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "111-А": {
    "group": "111-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "111-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська література",
            "room": "212",
            "teacher": "Коваль Л.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Небож І.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Біологія і екологія",
            "room": "320п",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "111-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "215п",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Всесвітня історія",
            "room": ".007",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "111-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Чмільова Н.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "111-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "111-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Захист України",
            "room": "502",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "111-А-wed-4-bot",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Осташевська Т.В.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "111-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізика і астрономія",
            "room": "215п",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "111-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "111-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "403",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "111-А-fri-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": "403",
            "teacher": "Коджебаш О.А.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "111-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "112-А": {
    "group": "112-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "112-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська література",
            "room": "212",
            "teacher": "Коваль Л.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "111п",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "112-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Всесвітня історія",
            "room": ".007",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "215п",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": "320п",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "112-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "219П",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "112-А-wed-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Чмільова Н.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "112-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "112-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "215п",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "219п",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "112-А-thu-4-bot",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Географія",
            "room": "320п",
            "teacher": "Коджебаш О.А.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "112-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": "320П",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "112-А-fri-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "112-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "112-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "113-А": {
    "group": "113-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "113-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "309",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "113-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "219п",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "215п",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Всесвітня історія",
            "room": ".007",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "113-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Єрохін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Чмільова Н.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "113-А-wed-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "113-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "502",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "113-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "215п",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська літертура",
            "room": "212",
            "teacher": "Коваль Л.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Географія",
            "room": "320П",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "113-А-thu-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "219П",
            "teacher": "Ходюк С.І.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "113-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "113-А-fri-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": "320П",
            "teacher": "Матусяк Л.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "113-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія іекологія",
            "room": "320П",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "113-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "114-А": {
    "group": "114-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "114-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "219п",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "402",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "114-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "312п",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": "320п",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "402",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "114-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "114-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Чмільова Н.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "114-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "402",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "114-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська літертура",
            "room": "212",
            "teacher": "Коваль Л.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Всесвітня історія",
            "room": "403",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "114-А-thu-4-bot",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "219П",
            "teacher": "Ходюк С.І.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "114-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Біологія і екологія",
            "room": "320П",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "114-А-fri-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "114-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "114-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "115-А": {
    "group": "115-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "115-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "115-А-mon-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Савченко Х.Д.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "115-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "309",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "115-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": "320п",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "115-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "402",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "115-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська література",
            "room": "212",
            "teacher": "Коваль Л.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "115-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "402",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "115-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "312п",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "115-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Єрохін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "115-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Чмільова Н.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "115-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "115-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист України",
            "room": "502",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "115-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "402",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "115-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Всесвітня історія",
            "room": ".007",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "115-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "115-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "1022",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "115-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "115-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "115-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Географія",
            "room": "403",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "115-А-fri-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": "403",
            "teacher": "Коджебаш О.А.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "115-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "116-А": {
    "group": "116-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "116-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "116-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Єрохін А.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "116-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "116-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "116-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Біологія і екологія",
            "room": "320п",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "116-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "312п",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "116-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист України",
            "room": "111п",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "116-А-tue-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист України",
            "room": "111п",
            "teacher": "Чорновол В.А.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "116-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Українська література",
            "room": "212",
            "teacher": "Коваль Л.П.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "116-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "116-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Чмільова Н.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "116-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "116-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "116-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "116-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "116-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Всесвітня історія",
            "room": ".007",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "116-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "116-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "1022",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "116-А-thu-4-bot",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "116-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "116-А-fri-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Біологія іекологія",
            "room": "320П",
            "teacher": "Матусяк Л.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "116-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "1022",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "211-А": {
    "group": "211-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "211-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Біологія і екологія",
            "room": "корп.2",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "корп.2",
            "teacher": "Саприкін Ю.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "211-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "211-А-tue-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": "",
            "teacher": "Щербина О.П.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "211-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Захист України",
            "room": "корп.2",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізична культура",
            "room": "корп.2",
            "teacher": "Небож І.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "211-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "корп.2",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "211-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Географія",
            "room": "",
            "teacher": "Радченко О.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "211-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "корп.2",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "211-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська література",
            "room": "корп.2",
            "teacher": "Щербіна О.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Захист України",
            "room": "корп.2",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Біологія і екологія",
            "room": "корп.2",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "211-А-thu-4-bot",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "",
            "teacher": "Саприкін Ю.М.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "211-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Всесвітня історія",
            "room": "корп.2",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Зарубіжна література",
            "room": "корп.2",
            "teacher": "Щербіна О.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "211-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "212-А": {
    "group": "212-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "212-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Всесвітня історія",
            "room": "корп.2",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "212-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": "корп.2",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "212-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "корп.2",
            "teacher": "Саприкін Ю.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "212-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "212-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "212-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "212-А-tue-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": "",
            "teacher": "Щербина О.П.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "212-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська література",
            "room": "корп.2",
            "teacher": "Щербіна О.П.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "212-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "корп.2",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "212-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "корп.2",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "212-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "",
            "teacher": "Радченко О.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "212-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "212-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізичне виховання",
            "room": "корп.2",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "212-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Біологія і екологія",
            "room": "корп.2",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "212-А-thu-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "",
            "teacher": "Саприкін Ю.М.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "212-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "212-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист України",
            "room": "корп.2",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "212-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": "корп.2",
            "teacher": "Щербіна О.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "212-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "212-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "212-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "корп.2",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "213-А": {
    "group": "213-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "213-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "корп.2",
            "teacher": "Саприкін Ю.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "213-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "213-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Захист України",
            "room": "корп.2",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "213-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": "корп.2",
            "teacher": "Щербина О.П.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "213-А-tue-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "",
            "teacher": "Худяк О.О.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "213-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "корп.2",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "213-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "213-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Географія",
            "room": "корп.2",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "213-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "",
            "teacher": "Шкурак Н.М.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "213-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": "корп.2",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "213-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізичне виховання",
            "room": "корп.2",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "213-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "213-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Захист України",
            "room": "корп.2",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "213-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська література",
            "room": "корп.2",
            "teacher": "Щербіна О.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "213-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": "корп.2",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "213-А-thu-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "",
            "teacher": "Саприкін Ю.М.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "213-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "213-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Всесвітня історія",
            "room": "корп.2",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "213-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "213-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "213-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Зарубіжна література",
            "room": "корп.2",
            "teacher": "Щербіна О.П.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "214-А": {
    "group": "214-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "214-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "214-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Всесвітня історія",
            "room": "корп.2",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "214-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": "корп.2",
            "teacher": "Щербина О.П.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "214-А-tue-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "",
            "teacher": "Худяк О.О.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "214-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "214-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична культура",
            "room": "корп.2",
            "teacher": "Небож І.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "214-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "корп.2",
            "teacher": "Саприкін Ю.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "214-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "214-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "корп.2",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "214-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "",
            "teacher": "Шкурак Н.М.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "214-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": "корп.2",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "214-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Іноземна мова",
            "room": "корп.2",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "214-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "214-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": "корп.2",
            "teacher": "Матусяк Л.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "214-А-thu-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "",
            "teacher": "Саприкін Ю.М.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "214-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська література",
            "room": "корп.2",
            "teacher": "Щербіна О.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "214-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "корп.2",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "214-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "214-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": "корп.2",
            "teacher": "Щербіна О.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "214-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист України",
            "room": "корп.2",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "214-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "311-А": {
    "group": "311-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "311-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "311-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "311-А-mon-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "311-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "311-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "311-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "311-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Всесвітня історія",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "311-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "311-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "311-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "311-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "311-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "311-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": ".001",
            "teacher": "Чмільова Н.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "311-А-thu-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "311-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "311-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "311-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "311-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "311-А-fri-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "311-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "311-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "312-А": {
    "group": "312-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "312-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Всесвітня історія",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "312-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "219п",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "312-А-tue-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "312-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "308",
            "teacher": "Жовтяк К.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "312-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "219П",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист Украіни",
            "room": "308",
            "teacher": "Жовтяк К.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "312-А-wed-4-bot",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "312-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": ".001",
            "teacher": "Чмільова Н.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "312-А-thu-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "312-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "306",
            "teacher": "Ємельянова К.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "312-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "313-А": {
    "group": "313-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "313-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "307",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "313-А-mon-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "313-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "313-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "313-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "313-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "313-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "313-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "313-А-tue-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "313-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Всесвітня історія",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "313-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "313-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "313-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": "307",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "313-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "313-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": "401",
            "teacher": "Бурлака А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "313-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": ".001",
            "teacher": "Чмільова Н.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "313-А-thu-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "313-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "313-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "313-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "209",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "313-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "411-А": {
    "group": "411-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "411-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Біологія і екологія",
            "room": "320п",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "411-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "320п",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "411-А-mon-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "411-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Небож І.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "411-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "411-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "411-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "411-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "111п",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "411-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська література",
            "room": ".007А",
            "teacher": "Щербіна О.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "411-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Всесвітня історія",
            "room": "403",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "411-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "411-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "411-А-thu-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "1022",
            "teacher": "Савченко Х.Д.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "411-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "1022",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "411-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": "402",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "411-А-thu-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": "320",
            "teacher": "Коджебаш О.А.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "411-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "411-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "209",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "411-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "411-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "411-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "412-А": {
    "group": "412-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "412-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "412-А-mon-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "307",
            "teacher": "Худяк О.О.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "412-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": ".008",
            "teacher": "Мельников О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "412-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Єрохін А.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "412-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "215п",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "412-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Захист України",
            "room": "111п",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "412-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "412-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Всесвітня історія",
            "room": "403",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "412-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська література",
            "room": ".007А",
            "teacher": "Щербіна О.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "412-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "412-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Хімія",
            "room": "307",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "412-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "412-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "219П",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "412-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "219П",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "412-А-thu-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": ".001",
            "teacher": "Чмільова Н.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "412-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "412-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": ".008",
            "teacher": "Мельников О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "412-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "412-А-fri-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "412-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "412-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Іноземна мова",
            "room": "306",
            "teacher": "Ємельянова К.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "413-А": {
    "group": "413-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "413-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "413-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "413-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська література",
            "room": "212",
            "teacher": "Коваль Л.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "413-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "413-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "413-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "413-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Зарубіжна література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "413-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізика і астрономія",
            "room": "312п",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "413-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Захист України",
            "room": "502",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "413-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "413-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Всесвітня історія",
            "room": "403",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "413-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "413-А-thu-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Самостоятельная работа",
            "room": "1022",
            "teacher": "",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "413-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізична культура Луговський А.П..",
            "room": "С/З",
            "teacher": "",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "413-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "413-А-thu-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "413-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Українська мова",
            "room": ".001",
            "teacher": "Чмільова Н.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "413-А-thu-4-bot",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "1022",
            "teacher": "Савченко Х.Д.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "413-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "413-А-fri-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Самостоятельная работа",
            "room": "1022",
            "teacher": "",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "413-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "413-А-fri-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "413-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "511-А": {
    "group": "511-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "511-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "511-А-mon-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "511-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": "404",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "511-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "1022",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "511-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": "403",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "511-А-tue-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Біологія і екологія",
            "room": ".008",
            "teacher": "Коджебаш О.А.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "511-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокіменко Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "511-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": ".008",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "511-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "511-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "511-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Нєбож І.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "511-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "511-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Українська література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "511-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "511-А-thu-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": ".001",
            "teacher": "Чмільова Н.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "511-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "308",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "511-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Всесвітня історія",
            "room": ".007",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "511-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Іноземна мова",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "511-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "511-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "511-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист України",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "512-А": {
    "group": "512-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "512-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Зарубіжна література",
            "room": "404",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "512-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "307",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "512-А-mon-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": "320п",
            "teacher": "Коджебаш О.А.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "512-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "512-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "512-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Зарубіжна література",
            "room": "403",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "512-А-tue-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "219п",
            "teacher": "Ходюк С.І.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "512-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Захист України",
            "room": "308",
            "teacher": "Жовтяк К.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "512-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "512-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Нєбож І.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "512-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "307",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "512-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "219п",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "512-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист Украіни",
            "room": "308",
            "teacher": "Жовтяк К.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "512-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Всесвітня історія",
            "room": "403",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "512-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "512-А-thu-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": ".001",
            "teacher": "Чмільова Н.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "512-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "512-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "512-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Біологія і екологія",
            "room": "403",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "512-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "512-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "513-А": {
    "group": "513-А",
    "course": 1,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "513-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Захист Украіни",
            "room": "111П",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "513-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокіменко Л.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "513-А-mon-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "307",
            "teacher": "Худяк О.О.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "513-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Зарубіжна література",
            "room": "404",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "513-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Українська література",
            "room": ".007а",
            "teacher": "Онищук Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "513-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "513-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "302",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "513-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": "403",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "513-А-tue-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Осташевська Т.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "513-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Захист України",
            "room": "502",
            "teacher": "Чорновол В.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "513-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "307",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "513-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "513-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Біологія і екологія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "513-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "513-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "308",
            "teacher": "Миронова Г.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "513-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Всесвітня історія",
            "room": "403",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "513-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "513-А-thu-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Зарубіжна література",
            "room": "402",
            "teacher": "Шкурак Н.М.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "513-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "513-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "405",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "513-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "121-А": {
    "group": "121-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "121-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Мистецтво",
            "room": "214",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Громадянська освіта",
            "room": "502",
            "teacher": "Вінічук М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Історія України",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "121-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Історія України",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": ".008",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "121-А-tue-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": "403",
            "teacher": "Шкурак Н.М.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "121-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "209",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "121-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "215П",
            "teacher": "Попенко Т.Є.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "121-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "121-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Теорія та будова судна",
            "room": "501",
            "teacher": "Говоров О.Б.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "121-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "215П",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізична виховання",
            "room": "С/З",
            "teacher": "Нєбож І.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "121-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "402",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "209",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "121-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "105",
            "teacher": "Саприкін Ю.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Теорія та устрій судна",
            "room": "501",
            "teacher": "Говоров О.Б.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Небож І.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "121-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Електротехніка",
            "room": "112",
            "teacher": "Кокошко Є.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "122-А": {
    "group": "122-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "122-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Ерохін А.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Мистецтво",
            "room": "214",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "309",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "122-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Кустура М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Громадянська освіта",
            "room": "502",
            "teacher": "Вінічук М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "122-А-tue-4-bot",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Теорія та будова судна",
            "room": "501",
            "teacher": "Говоров О.Б.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "122-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика",
            "room": "208",
            "teacher": "Сіза С.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "122-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "309",
            "teacher": "Бондаренко І.Г.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "122-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "215П",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "122-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "122-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Ерохін А.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "122-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Електротехніка",
            "room": "112",
            "teacher": "Кокошко Є.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "320П",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "215П",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "122-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова ЧеревкоА.О.",
            "room": "404",
            "teacher": "",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Історія України",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "122-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Теорія та устрій судна",
            "room": "501",
            "teacher": "Говоров О.Б.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "123-А": {
    "group": "123-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "123-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Громадянська освіта",
            "room": "502",
            "teacher": "Вінічук М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "123-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "402",
            "teacher": "Медвєдєва І.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "123-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Кустура М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "123-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Мистецтво",
            "room": "214",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "123-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "123-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Теорія та будова судна",
            "room": "501",
            "teacher": "Говоров О.Б.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "123-А-tue-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "123-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "123-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика",
            "room": "402",
            "teacher": "Медвєдєва І.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "123-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "123-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Електротехніка",
            "room": "112",
            "teacher": "Кокошко Є.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "123-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична виховання",
            "room": "С/З",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "123-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Теорія та будова судна",
            "room": "501",
            "teacher": "Говоров О.Б.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "123-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": ".008",
            "teacher": "Мельников О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "123-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "123-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "123-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Історія України",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "123-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "123-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": ".008",
            "teacher": "Мельников О.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "123-А-fri-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "123-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Українська мова ЧеревкоА.О.",
            "room": "404",
            "teacher": "",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "124-А": {
    "group": "124-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "124-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "402",
            "teacher": "Медвєдєва І.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Громадянська освіта",
            "room": "502",
            "teacher": "Вінічук М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Мистецтво",
            "room": "214",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "124-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "310",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "304",
            "teacher": "Кустура М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Теорія та будова судна",
            "room": "501",
            "teacher": "Говоров О.Б.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "124-А-tue-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "124-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "124-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика",
            "room": "402",
            "teacher": "Медвєдєва І.О.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "124-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізична виховання",
            "room": "С/З",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Теорія та будова судна",
            "room": "501",
            "teacher": "Говоров О.Б.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "124-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Географія",
            "room": "320П",
            "teacher": "Коджебаш О.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": ".008",
            "teacher": "Мельников О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Історія України",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "124-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична культура",
            "room": "с/з",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Електротехніка",
            "room": "112",
            "teacher": "Кокошко Є.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "124-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "311",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "124-А-fri-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": ".008",
            "teacher": "Мельников О.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "124-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Історія України",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "125-А": {
    "group": "125-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "125-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична виховання",
            "room": "С/З",
            "teacher": "Нєбож І.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "125-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Громадянська освіта",
            "room": "502",
            "teacher": "Вінічук М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": "103",
            "teacher": "Шакайло К.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Теорія та будова судна",
            "room": "501",
            "teacher": "Говоров О.Б.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "125-А-tue-4-bot",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "125-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "215П",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "125-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "209",
            "teacher": "Мулакі І.Г.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "125-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "125-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "125-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична виховання",
            "room": "С/З",
            "teacher": "Нєбож І.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізика і астрономія",
            "room": "215П",
            "teacher": "Попенко Т.Є.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "125-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "113",
            "teacher": "Скоромна М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Електротехніка",
            "room": "112",
            "teacher": "Кокошко Є.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "209",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "125-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Мистецтво",
            "room": "214",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Теорія та устрій судна",
            "room": "501",
            "teacher": "Говоров О.Б.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "125-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Інформатика",
            "room": "105",
            "teacher": "Саприкін Ю.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "221-А": {
    "group": "221-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "221-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Основи технічної термодинаміки та теплопередачі",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "корп.2",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": "корп.2",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Технологія матеріалів",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "221-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізична культура",
            "room": "корп.2",
            "teacher": "Єрохін А.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "корп.2",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Технічна механіка (теоретична механіка, опір матеріалів, деталі машин)",
            "room": "корп.2",
            "teacher": "Чеботар Р.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "221-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "корп.2",
            "teacher": "Левашова О.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "221-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "",
            "teacher": "Черевко А.О.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "221-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Географія",
            "room": "корп.2",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "221-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "ФІзична культура",
            "room": "корп.2",
            "teacher": "Єрохін А.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Медведєва І.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "221-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "221-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Громадянська освіта",
            "room": "корп.2",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "222-А": {
    "group": "222-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "222-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Географія",
            "room": "корп.2",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Українська мова",
            "room": "корп.2",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "222-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Технічна механіка (теоретична механіка, опір матеріалів, деталі машин)",
            "room": "корп.2",
            "teacher": "Чеботар Р.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Основи технічної термодинаміки та теплопередачі",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Іноземна мова",
            "room": "корп.2",
            "teacher": "Сабенгуз С.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "222-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "корп.2",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "222-А-wed-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "",
            "teacher": "Левашова О.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "222-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізична культура",
            "room": "корп.2",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "222-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Технологія матеріалів",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "222-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "фізична культура",
            "room": "корп.2",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Громадянська освіта",
            "room": "корп.2",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "222-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "корп.2",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "223-А": {
    "group": "223-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "223-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Географія",
            "room": "корп.2",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "корп.2",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "223-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "корп.2",
            "teacher": "Савченко Х.Д.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична культура",
            "room": "корп.2",
            "teacher": "Єрохін А.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Іноземна мова",
            "room": "корп.2",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "223-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Технічна механіка (теоретична механіка, опір матеріалів, деталі машин)",
            "room": "корп.2",
            "teacher": "Чеботар Р.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "корп.2",
            "teacher": "Левашова О.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "223-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "",
            "teacher": "Черевко А.О.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "223-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Технологія матеріалів",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "ФІзична культура",
            "room": "корп.2",
            "teacher": "Єрохін А.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "223-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Основи технічної термодинаміки та теплопередачі",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "223-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Громадянська освіта",
            "room": "корп.2",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "224-А": {
    "group": "224-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "224-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Технологія матеріалів",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Географія",
            "room": "корп.2",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "224-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Громадянська освіта",
            "room": "корп.2",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "корп.2",
            "teacher": "Сабенгуз С.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Основи технічної термодинаміки та теплопередачі",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "224-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична культура",
            "room": "корп.2",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Технічна механіка (теоретична механіка, опір матеріалів, деталі машин)",
            "room": "корп.2",
            "teacher": "Чеботар Р.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": "корп.2",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "224-А-wed-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "",
            "teacher": "Левашова О.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "224-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Українська мова",
            "room": "корп.2",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "224-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "224-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "корп.2",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "фізична культура",
            "room": "корп.2",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "224-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "225-А": {
    "group": "225-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "225-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "корп.2",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Географія",
            "room": "корп.2",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "225-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична культура",
            "room": "корп.2",
            "teacher": "Єрохін А.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "корп.2",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "225-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика і астрономія",
            "room": "корп.2",
            "teacher": "Стіранець М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "корп.2",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "225-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "",
            "teacher": "Левашова О.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "225-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Технічна механіка (теоретична механіка, опір матеріалів, деталі машин)",
            "room": "корп.2",
            "teacher": "Чеботар Р.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "225-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "ФІзична культура",
            "room": "корп.2",
            "teacher": "Єрохін А.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "корп.2",
            "teacher": "Маренок Л.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": "корп.2",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Технологія матеріалів",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "225-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Громадянська освіта",
            "room": "корп.2",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "корп.2",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": "корп.2",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "225-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Основи технічної термодинаміки та теплопередачі",
            "room": "корп.2",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "321-А": {
    "group": "321-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "321-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Історія України",
            "room": ".007",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "209",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика та астрономія",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "321-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "105",
            "teacher": "Саприкін Ю.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "321-А-tue-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "321-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "321-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Історія України",
            "room": ".007",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика",
            "room": "305",
            "teacher": "Осташевська Т.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "321-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "209",
            "teacher": "Мулакі І.Г.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "321-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика та астрономія",
            "room": "312п",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "321-А-wed-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Загальний курс транспорту",
            "room": "322п",
            "teacher": "Аноріна В.В.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "321-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Загальний курс транспорту",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Загальна електротехніка",
            "room": "112",
            "teacher": "Кокошко Є.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "321-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична культура",
            "room": "с\\з",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Мистецтво",
            "room": "214",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "321-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Громадянська освіта",
            "room": ".007",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "322-А": {
    "group": "322-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "322-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика та астрономія",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Історія України",
            "room": ".007",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "322-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Інформатика",
            "room": "105",
            "teacher": "Саприкін Ю.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "322-А-tue-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "322-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "501",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "322-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Загальний курс транспорту",
            "room": "322п",
            "teacher": "Аноріна В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Історія України",
            "room": ".007",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Іноземна мова",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "322-А-wed-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика та астрономія",
            "room": "312п",
            "teacher": "Худяк О.В.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "322-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Загальний курс транспорту",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "322-А-thu-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "501а",
            "teacher": "Підмогильна Н.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "322-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Загальна електротехніка",
            "room": "112",
            "teacher": "Кокошко Є.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "322-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Громадянська освіта",
            "room": ".007",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "фізична культура",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Мистецтво",
            "room": "214",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "322-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "323-А": {
    "group": "323-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "323-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "209",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "323-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика та астрономія",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "323-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": ".007",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "323-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "323-А-tue-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "323-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "501",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "323-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "105",
            "teacher": "Кустура М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "323-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "323-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "323-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "209",
            "teacher": "Мулакі І.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "323-А-wed-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Загальний курс транспорту",
            "room": "322п",
            "teacher": "Аноріна В.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "323-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": ".007",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "323-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "323-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Загальний курс транспорту",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "323-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "501а",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "323-А-thu-3-bot",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізика і астрономія",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "323-А-thu-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "323-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Загальна електротехніка",
            "room": "112",
            "teacher": "Кокошко Є.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "323-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Громадянська освіта",
            "room": ".007",
            "teacher": "Панін В.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "323-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "фізична культура",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "323-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Мистецтво",
            "room": "214",
            "teacher": "Опря Р.Л.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "421-А": {
    "group": "421-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "421-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізика та астрономія",
            "room": ".008",
            "teacher": "Мельніков О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Історія України",
            "room": "403",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Хімія",
            "room": "307",
            "teacher": "Худяк О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Технічна механіка (теоретична механіка, опір матеріалів, деталі машин)",
            "room": ".008",
            "teacher": "Мельніков О.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "421-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "501",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "421-А-tue-2-bot",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "403",
            "teacher": "Шкурак Н.М.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "421-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "421-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Технічна термодинаміка та гідравліка",
            "room": ".001",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Історія України",
            "room": ".005",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Устрій та основи теорії суден",
            "room": ".004",
            "teacher": "Шевченко О.Т.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "421-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Математика (алгебра і початок аналізу та геометрія) Підмогильна Н.С.І.",
            "room": "501а",
            "teacher": "",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Українська мова",
            "room": "402",
            "teacher": "Шкурак Н.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Громадянська освіта",
            "room": "502",
            "teacher": "Вінічук М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "421-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Іноземна мова",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізика і астрономія",
            "room": ".008",
            "teacher": "Мельников О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Інформатика",
            "room": "105",
            "teacher": "Саприкін Ю.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "421-А-fri-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "422-А": {
    "group": "422-А",
    "course": 2,
    "base": "9 кл",
    "shift": 1,
    "shiftName": "1 смена",
    "address": "вул. Канатна, 8",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "422-А-mon-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Історія України",
            "room": "403",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-mon-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Іноземна мова",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-mon-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Технічна механіка (теоретична механіка, опір матеріалів, деталі машин)",
            "room": ".008",
            "teacher": "Мельніков О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-mon-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізика та астрономія",
            "room": "312п",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "422-А-tue-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Українська мова",
            "room": "404",
            "teacher": "Черевко А.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "422-А-tue-1-bot",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Нарисна геометрія та інженерна графіка",
            "room": "313",
            "teacher": "Орлова А.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "422-А-tue-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-tue-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Математика (алгебра і початки аналізу та геометрія)",
            "room": "501",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-tue-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Географія",
            "room": "213",
            "teacher": "Радченко О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "422-А-wed-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Технічна термодинаміка та гідравліка",
            "room": ".001",
            "teacher": "Шалан О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-wed-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Історія України",
            "room": ".004",
            "teacher": "Кічук О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-wed-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Устрій та основи теорії суден",
            "room": ".004",
            "teacher": "Шевченко О.Т.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-wed-4-top",
            "pairNum": 4,
            "time": "13:40 - 15:00",
            "name": "Фізика та астрономія",
            "room": "312п",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "422-А-thu-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Громадянська освіта",
            "room": "502",
            "teacher": "Вінічук М.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-thu-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Математика (алгебра і початок аналізу та геометрія)",
            "room": "501а",
            "teacher": "Підмогильна Н.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-thu-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Фізична культура",
            "room": "С/З",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "422-А-fri-1-top",
            "pairNum": 1,
            "time": "09:00 - 10:20",
            "name": "Хімія",
            "room": ".009",
            "teacher": "Євдокименко Л.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-fri-2-top",
            "pairNum": 2,
            "time": "10:30 - 11:50",
            "name": "Інформатика",
            "room": "105",
            "teacher": "Саприкін Ю.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "422-А-fri-3-top",
            "pairNum": 3,
            "time": "12:10 - 13:30",
            "name": "Українська мова ЧеревкоА.О.",
            "room": "404",
            "teacher": "",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "131-А": {
    "group": "131-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "131-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Управління судном",
            "room": "корп№3",
            "teacher": "Райнов О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "131-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електронавігаційні прилади",
            "room": "корп№3",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "131-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднові енергетичні установки та електрообладнання",
            "room": "корп№3",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "131-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Електронавігаційні прилади",
            "room": "312",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "131-А-tue-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Управління судном",
            "room": "316",
            "teacher": "Райнов О.О.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "131-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "131-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Морехідна астрономія",
            "room": "каб/нав",
            "teacher": "Коршунов О.К.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "131-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Англійська мова (за професійним спрямуванням)",
            "room": "309",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "131-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи національного спротиву",
            "room": "501",
            "teacher": "Сергєєв В.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "131-А-wed-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Технологія перевезення вантажів",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "131-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи національного спротиву",
            "room": "501",
            "teacher": "Сергєєв В.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "131-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Морське право",
            "room": "корп. 3",
            "teacher": "Лобасюк-Скворнюк Є.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "131-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Соціологія",
            "room": "корп. 3",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "131-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Безпека та охорона на морі",
            "room": "корп. 3",
            "teacher": "Коршунов О.К.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "131-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Технологія перевезення вантажів",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "131-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Професійна англійська мова",
            "room": "309",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "131-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Навігація і лоція",
            "room": "каб.нав.",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "132-А": {
    "group": "132-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "132-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Управління судном",
            "room": "корп№3",
            "teacher": "Райнов О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "132-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електронавігаційні прилади",
            "room": "корп№3",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "132-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднові енергетичні установки та електрообладнання",
            "room": "корп№3",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "132-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Луговський А.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "132-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Управління судном",
            "room": "316",
            "teacher": "Райнов О.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "132-А-tue-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електронавігаційні прилади",
            "room": "312",
            "teacher": "Юхименко Г.Г.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "132-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи національного спротиву",
            "room": "501",
            "teacher": "Орешенко В.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "132-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Навігація і лоція",
            "room": "каб.нав",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "132-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Англійська мова (за професійним спрямуванням)",
            "room": "309",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "132-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Морехідна астрономія",
            "room": "314",
            "teacher": "Коршунов О.К.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "132-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Морське право",
            "room": "корп.3",
            "teacher": "Лобасюк-Скворнюк Є.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "132-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Соціологія",
            "room": "корп. 3",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "132-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Безпека та охорона на морі",
            "room": "корп. 3",
            "teacher": "Коршунов О.К.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "132-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Професійна англійська мова",
            "room": "309",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "132-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Технологія перевезення вантажів",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "132-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи національно спротиву",
            "room": "316",
            "teacher": "Орешенко В.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "132-А-fri-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Технологія перевезення вантажів",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "133-А": {
    "group": "133-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "133-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Управління судном",
            "room": "корп№3",
            "teacher": "Райнов О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "133-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електронавігаційні прилади",
            "room": "корп№3",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "133-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднові енергетичні установки та електрообладнання",
            "room": "корп№3",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "133-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Морехідна астрономія",
            "room": "каб/нав",
            "teacher": "Коршунов О.К.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "133-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Технологія перевезення вантажів",
            "room": "208",
            "teacher": "Лобасюк Є.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "133-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Управління судном",
            "room": "316",
            "teacher": "Райнов О.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "133-А-tue-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Електронавігаційні прилади",
            "room": "312",
            "teacher": "Юхименко Г.Г.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "133-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Основи національного спротиву",
            "room": "316",
            "teacher": "Орєшенко В.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "133-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Англійська мова (за професійним спрямуванням)",
            "room": "310",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "133-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Навігація і лоція",
            "room": "каб.нав",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "133-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Морське право",
            "room": "корп.3",
            "teacher": "Лобасюк-Скворнюк Є.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "133-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Соціологія",
            "room": "корп. 3",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "133-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Безпека та охорона на морі",
            "room": "корп. 3",
            "teacher": "Коршунов О.К.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "133-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Небож І.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "133-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Англійська мова (за професійним спрямуванням)",
            "room": "310",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "133-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Технологія перевезення вантажів",
            "room": "208",
            "teacher": "Лобасюк Є.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "133-А-fri-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи національно спротиву",
            "room": "316",
            "teacher": "Орешенко В.А.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "134-А": {
    "group": "134-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "134-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Управління судном",
            "room": "корп№3",
            "teacher": "Райнов О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "134-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електронавігаційні прилади",
            "room": "корп№3",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "134-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднові енергетичні установки та електрообладнання",
            "room": "корп№3",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "134-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Управління судном",
            "room": "316",
            "teacher": "Райнов О.О.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "134-А-tue-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Електронавігаційні прилади",
            "room": "312",
            "teacher": "Юхименко Г.Г.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "134-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Морехідна астрономія",
            "room": "каб/нав",
            "teacher": "Коршунов О.К.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "134-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Технологія перевезення вантажів",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "134-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Англійська мова (за професійним спрямуванням)",
            "room": "310",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "134-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи національного спротиву",
            "room": "105",
            "teacher": "Саприкін Ю.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "134-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи національного спротиву",
            "room": "105",
            "teacher": "Саприкін Ю.М.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "134-А-wed-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Технологія перевезення вантажів",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "134-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Морське право",
            "room": "корп.3",
            "teacher": "Лобасюк-Скворнюк Є.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "134-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Соціологія",
            "room": "корп. 3",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "134-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Безпека та охорона на морі",
            "room": "корп. 3",
            "teacher": "Коршунов О.К.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "134-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Навігація і лоція",
            "room": "каб.нав.",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "134-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "134-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Англійська мова (за професійним спрямуванням)",
            "room": "311",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "135-А": {
    "group": "135-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "135-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Управління судном",
            "room": "корп№3",
            "teacher": "Райнов О.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "135-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електронавігаційні прилади",
            "room": "корп№3",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "135-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднові енергетичні установки та електрообладнання",
            "room": "корп№3",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "135-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Технологія перевезення вантажів",
            "room": "208",
            "teacher": "Лобасюк Є.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "135-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи національного спротиву",
            "room": "111п",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "135-А-tue-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Управління судном",
            "room": "316",
            "teacher": "Райнов О.О.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "135-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Електронавігаційні прилади",
            "room": "312",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "135-А-tue-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Технологія перевезення вантажів",
            "room": "208",
            "teacher": "Лобасюк Є.О.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "135-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Морехідна астрономія",
            "room": "314",
            "teacher": "Коршунов О.К.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "135-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "135-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Англійська мова (за професійним спрямуванням)",
            "room": "310",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "135-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Морське право",
            "room": "корп.3",
            "teacher": "Лобасюк-Скворнюк Є.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "135-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Соціологія",
            "room": "корп. 3",
            "teacher": "Руденко Ю.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "135-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Безпека та охорона на морі",
            "room": "корп. 3",
            "teacher": "Коршунов О.К.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "135-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Англійська мова (за професійним спрямуванням)",
            "room": "311",
            "teacher": "Кулікова І.Я.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "135-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Навігація і лоція",
            "room": "каб.нав.",
            "teacher": "Юхименко Г.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "135-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи національного спротиву",
            "room": "111П",
            "teacher": "Плетенець М.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "231-А": {
    "group": "231-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "231-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Охорона праці та цивільний захист",
            "room": "корп№2",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "231-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Суднова енергетика",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "231-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи філософських знань",
            "room": "корп№2",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "231-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Англійська мова (за проф.спрямуванням)",
            "room": "корп№2",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "231-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електротехніка та основи електроніки",
            "room": "корп№2",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "231-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднові дизельні установки",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "231-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Теорія, будова судна та рушія",
            "room": "корп№2",
            "teacher": "Юхименко М.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "231-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Суднові котельні установки",
            "room": "корп№2",
            "teacher": "Бондар С.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "231-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Безпека життєдіяльності",
            "room": "корп№2",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "231-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Фізичне виховання",
            "room": "корп№2",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "231-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи національного спротиву",
            "room": "корп№2",
            "teacher": "Сєргєєв В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "231-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Англійська мова (за проф. спрям.)",
            "room": "корп№2",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "231-А-thu-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Теорія, будова судна та рушії",
            "room": "",
            "teacher": "Юхименко М.Г.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "231-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Суднові допоміжні механізми, устрої та системи",
            "room": "корп№2",
            "teacher": "Очеретяний Ю.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "231-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Суднові дизельні установки",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "231-А-fri-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електрообладнання",
            "room": "корп№2",
            "teacher": "Демиденко О.Д.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "231-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи національного спротиву",
            "room": "корп№2",
            "teacher": "Сєргєєв В.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "231-А-fri-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Електротехніка та основи електроніки",
            "room": "корп№2",
            "teacher": "Кошелик Л.А.",
            "type": "Практика",
            "week": "odd"
          },
          {
            "id": "231-А-fri-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Самостоятельная работа",
            "room": "ЗАНЯТТЯ ПРОВОДЯТЬСЯ ЗА АДРЕСОЮ вул. КАНАТНА, 8 початок занять о 9:00",
            "teacher": "",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "232-А": {
    "group": "232-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "232-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Охорона праці та цивільний захист",
            "room": "корп№2",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "232-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Суднова енергетика",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "232-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи філософських знань",
            "room": "корп№2",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "232-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Суднові дизельні установки",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "232-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Англійська мова (за проф.спрямуванням)",
            "room": "корп№2",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "232-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Електротехніка та основи електроніки",
            "room": "корп№2",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "232-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Теорія, будова судна та рушія",
            "room": "корп№2",
            "teacher": "Юхименко М.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "232-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Суднові котельні установки",
            "room": "корп№2",
            "teacher": "Бондар С.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "232-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Безпека життєдіяльності",
            "room": "корп№2",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "232-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Основи національного спротиву",
            "room": "корп№2",
            "teacher": "Сєргєєв В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "232-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Англійська мова (за проф. спрям.)",
            "room": "корп№2",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "232-А-thu-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Теорія, будова судна та рушії",
            "room": "",
            "teacher": "Юхименко М.Г.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "232-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднові допоміжні механізми, устрої та системи",
            "room": "корп№2",
            "teacher": "Очеретяний Ю.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "232-А-thu-4-top",
            "pairNum": 4,
            "time": "18:10 - 19:30",
            "name": "фізичне виховання",
            "room": "корп.2",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "232-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Суднові дизельні установки",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "232-А-fri-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Електрообладнання",
            "room": "корп№2",
            "teacher": "Демиденко О.Д.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "232-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи національного спротиву",
            "room": "корп№2",
            "teacher": "Сєргєєв В.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "232-А-fri-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електротехніка та основи електроніки",
            "room": "корп№2",
            "teacher": "Кошелик Л.А.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "233-А": {
    "group": "233-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "233-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Охорона праці та цивільний захист",
            "room": "корп№2",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "233-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Суднова енергетика",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "233-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи філософських знань",
            "room": "корп№2",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "233-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Основи національного спротиву",
            "room": "корп№2",
            "teacher": "Сєргєєв В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "233-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Суднові дизельні установки",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "233-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Англійська мова (за проф.спрямуванням)",
            "room": "корп№2",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "233-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Суднові котельні установки",
            "room": "корп№2",
            "teacher": "Бондар С.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "233-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Теорія, будова судна та рушія",
            "room": "корп№2",
            "teacher": "Юхименко М.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "233-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Безпека життєдіяльності",
            "room": "корп№2",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "233-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Англійська мова (за проф. спрям.)",
            "room": "корп№2",
            "teacher": "Бондаренко І.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "233-А-thu-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Теорія, будова судна та рушії",
            "room": "",
            "teacher": "Юхименко М.Г.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "233-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "фізичне виховання",
            "room": "корп№2",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "233-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Електротехніка та основи електроніки",
            "room": "корп№2",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "233-А-thu-4-top",
            "pairNum": 4,
            "time": "18:10 - 19:30",
            "name": "Суднові допоміжні механізми, устрої та системи",
            "room": "корп№2",
            "teacher": "Очеретяний Ю.О",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "233-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Основи національного спротиву",
            "room": "корп№2",
            "teacher": "Сєргєєв В.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "233-А-fri-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Електротехніка та основи електроніки",
            "room": "корп№2",
            "teacher": "Кошелик Л.А.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "233-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електрообладнання",
            "room": "корп№2",
            "teacher": "Демиденко О.Д.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "233-А-fri-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Суднові дизельні установки",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "234-А": {
    "group": "234-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "234-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Основи філософських знань",
            "room": "корп№2",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "234-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Охорона праці та цивільний захист",
            "room": "корп№2",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "234-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Фізичне виховання",
            "room": "корп№2",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "234-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Англійська мова (за проф.спрямуванням)",
            "room": "корп№2",
            "teacher": "Сабенгуз С.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "234-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи національного спротиву",
            "room": "корп№2",
            "teacher": "Сєргєєв В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "234-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднові допоміжні механізми, устрої та системи",
            "room": "корп№2",
            "teacher": "Очеретяний Ю.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "234-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Суднові котельні установки",
            "room": "корп№2",
            "teacher": "Бондар С.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "234-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Теорія, будова судна та рушія",
            "room": "корп№2",
            "teacher": "Юхименко М.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "234-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднова енергетика",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "234-А-wed-4-top",
            "pairNum": 4,
            "time": "18:10 - 19:30",
            "name": "Безпека життєдіяльності",
            "room": "корп№2",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "234-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Електротехніка та основи електроніки",
            "room": "корп№2",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "234-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Теорія, будова судна та рушії",
            "room": "корп№2",
            "teacher": "Юхименко М.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "234-А-thu-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Англійська мова (за проф. спрям.)",
            "room": "",
            "teacher": "Сабенгуз С.Г.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "234-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Електрообладнання",
            "room": "корп№2",
            "teacher": "Демиденко О.Д.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "234-А-fri-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Суднові дизельні установки",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "234-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електротехніка та основи електроніки",
            "room": "корп№2",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "234-А-fri-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи національного спротиву",
            "room": "корп№2",
            "teacher": "Сєргєєв В.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "234-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднові дизельні установки",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "235-А": {
    "group": "235-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "235-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Основи філософських знань",
            "room": "корп№2",
            "teacher": "Надибська С.Б.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "235-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Охорона праці та цивільний захист",
            "room": "корп№2",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "235-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Суднові дизельні установки",
            "room": "корп№2",
            "teacher": "Очеретяний Ю.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "235-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Англійська мова (за проф.спрямуванням)",
            "room": "корп№2",
            "teacher": "Сабенгуз С.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "235-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи національного спротиву",
            "room": "корп№2",
            "teacher": "Сєргєєв В.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "235-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Суднові котельні установки",
            "room": "корп№2",
            "teacher": "Бондар С.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "235-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Теорія, будова судна та рушія",
            "room": "корп№2",
            "teacher": "Юхименко М.Г.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "235-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднова енергетика",
            "room": "корп№2",
            "teacher": "Доманін О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "235-А-wed-4-top",
            "pairNum": 4,
            "time": "18:10 - 19:30",
            "name": "Безпека життєдіяльності",
            "room": "корп№2",
            "teacher": "Солоненко С.О.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "235-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Теорія, будова судна та рушії",
            "room": "корп№2",
            "teacher": "Юхименко М.Г.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "235-А-thu-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Англійська мова (за проф. спрям.)",
            "room": "",
            "teacher": "Сабенгуз С.Г.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "235-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електротехніка та основи електроніки",
            "room": "корп№2",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "235-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Фізичне виховання",
            "room": "корп№2",
            "teacher": "Войкін А.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "235-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Електротехніка та основи електроніки",
            "room": "корп№2",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "235-А-fri-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Основи національного спротиву",
            "room": "корп№2",
            "teacher": "Сєргєєв В.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "235-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Суднові допоміжні механізми, устрої та системи",
            "room": "корп№2",
            "teacher": "Очеретяний Ю.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "235-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Електрообладнання",
            "room": "корп№2",
            "teacher": "Демиденко О.Д.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "235-А-fri-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Суднові дизельні установки",
            "room": "корп№2",
            "teacher": "Очеретяний Ю.О.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "331-А": {
    "group": "331-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "331-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "331-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Англійська мова (за проф. спрямуванням)",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "331-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Вантажознавство",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "331-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Організація перевезень на МТ",
            "room": "322п",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "331-А-tue-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "ТОППР",
            "room": "214",
            "teacher": "Левашова О.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "331-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Устрій морських портів",
            "room": "214",
            "teacher": "Сушенцова Г.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "331-А-tue-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Вантажознавство",
            "room": "322п",
            "teacher": "Аноріна В.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "331-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Комп'ютерна техніка та програмування",
            "room": "219п",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "331-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Безпека життєдіяльності",
            "room": "316",
            "teacher": "Шевчук В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "331-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи фінансів і бухгалтерського обліку",
            "room": "316",
            "teacher": "Ротарь О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "331-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Комерційна робота на морському транспорті",
            "room": "316",
            "teacher": "Станєва Я.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "331-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Технологія, організація та планування портових перевантажувальних робіт",
            "room": "316",
            "teacher": "Левашова О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "331-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Організація перевезень на морському транспорті",
            "room": "316",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "331-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Устрій морських портів",
            "room": "316",
            "teacher": "Сушенцова Г.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "331-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Англійська мова (за професійним срямуванням)",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "331-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи національного спротивуі",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "331-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Вантажознавство",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "332-А": {
    "group": "332-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "332-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Вантажознавство",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "332-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "332-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Комп'ютерна техніка та програмування",
            "room": "219п",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "332-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Устрій морських портів",
            "room": "214",
            "teacher": "Сушенцова Г.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "332-А-tue-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Вантажознавство",
            "room": "322п",
            "teacher": "Аноріна В.В.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "332-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Англійська мова (за проф.спрямуванням)",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "332-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Організація перевезень на МТ",
            "room": "322п",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "332-А-tue-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "ТОППР",
            "room": "214",
            "teacher": "Левашова О.С.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "332-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Безпека життєдіяльності",
            "room": "316",
            "teacher": "Шевчук В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "332-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи фінансів і бухгалтерського обліку",
            "room": "316",
            "teacher": "Ротарь О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "332-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Комерційна робота на морському транспорті",
            "room": "316",
            "teacher": "Станєва Я.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "332-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Технологія, організація та планування портових перевантажувальних робіт",
            "room": "316",
            "teacher": "Левашова О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "332-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Організація перевезень на морському транспорті",
            "room": "316",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "332-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Устрій морських портів",
            "room": "316",
            "teacher": "Сушенцова Г.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "332-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Вантажознавство",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "332-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Англійська мова (за професійним спрямуванням)",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "332-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи національного спротивуі",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "333-А": {
    "group": "333-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "333-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Комп'ютерна техніка та програмування",
            "room": "219п",
            "teacher": "Ходюк С.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "333-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Вантажознавство",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "333-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Кульбачук М.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "333-А-mon-4-top",
            "pairNum": 4,
            "time": "18:10 - 19:30",
            "name": "Англійська мова (за проф. спрямуванням)",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "333-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Англійська мова (за проф.спрямуванням)",
            "room": "503",
            "teacher": "Гачук О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "333-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Організація перевезень на МТ",
            "room": "322п",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "333-А-tue-2-bot",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "ТОППР",
            "room": "214",
            "teacher": "Левашова О.С.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "333-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Устрій морських портів",
            "room": "214",
            "teacher": "Сушенцова Г.В.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "333-А-tue-3-bot",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Вантажознавство",
            "room": "322п",
            "teacher": "Аноріна В.В.",
            "type": "Практика",
            "week": "even"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "333-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Безпека життєдіяльності",
            "room": "316",
            "teacher": "Шевчук В.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "333-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи фінансів і бухгалтерського обліку",
            "room": "316",
            "teacher": "Ротарь О.М.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "333-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Комерційна робота на морському транспорті",
            "room": "316",
            "teacher": "Станєва Я.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "333-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Технологія, організація та планування портових перевантажувальних робіт",
            "room": "316",
            "teacher": "Левашова О.С.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "333-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Організація перевезень на морському транспорті",
            "room": "316",
            "teacher": "Івлєва С.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "333-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Устрій морських портів",
            "room": "316",
            "teacher": "Сушенцова Г.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "333-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Основи національного спротиву",
            "room": "312П",
            "teacher": "Худяк О.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "333-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Вантажознавство",
            "room": "313",
            "teacher": "Аноріна В.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  },
  "431-А": {
    "group": "431-А",
    "course": 3,
    "base": "9 кл",
    "shift": 2,
    "shiftName": "2 смена",
    "address": "вул. Канатна, 8 (2 зміна)",
    "days": [
      {
        "id": "mon",
        "name": "Понедельник",
        "lessons": [
          {
            "id": "431-А-mon-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Електротехніка",
            "room": "323п",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "431-А-mon-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Основи електроніки",
            "room": "323п",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "431-А-mon-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Гідро- та пневмо приводи портових перевантажувальних машин",
            "room": ".004",
            "teacher": "Ремінь А.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "tue",
        "name": "Вторник",
        "lessons": [
          {
            "id": "431-А-tue-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Англійська мова(за проф.спрямуванням)",
            "room": "306",
            "teacher": "Ємельянова К.І.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "431-А-tue-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Експлуатація, ремонт та монтаж ППМ",
            "room": ".005",
            "teacher": "Чебан А.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "431-А-tue-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Основи національного спротиву",
            "room": ".004",
            "teacher": "Ремінь А.В.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "wed",
        "name": "Среда",
        "lessons": [
          {
            "id": "431-А-wed-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Технологія та механізація ПР",
            "room": "214",
            "teacher": "Малікова О.А.",
            "type": "Лекция",
            "week": "odd"
          },
          {
            "id": "431-А-wed-1-bot",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Портові перевантажувальні машини",
            "room": ".004",
            "teacher": "Кокошко Є.М.",
            "type": "Практика",
            "week": "even"
          },
          {
            "id": "431-А-wed-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Устрій морських портів",
            "room": "214",
            "teacher": "Сушенцова Г.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "431-А-wed-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Електротехніка",
            "room": "323П",
            "teacher": "Кошелик Л.А.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "thu",
        "name": "Четверг",
        "lessons": [
          {
            "id": "431-А-thu-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Метрологія, стандартизація, система якості.",
            "room": "302",
            "teacher": "Сочинська О.П.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "431-А-thu-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Електроустаткування портових перевантажувальних машин",
            "room": ".005",
            "teacher": "Чебан А.О.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "431-А-thu-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Метрологія, стандартизація, система якості.",
            "room": "302",
            "teacher": "Сочинська О.П.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "fri",
        "name": "Пятница",
        "lessons": [
          {
            "id": "431-А-fri-1-top",
            "pairNum": 1,
            "time": "13:40 - 15:00",
            "name": "Фізичне виховання",
            "room": "С/З",
            "teacher": "Небож І.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "431-А-fri-2-top",
            "pairNum": 2,
            "time": "15:10 - 16:30",
            "name": "Двигуни внутрішнього згоряння портових перевантажувальних машин",
            "room": ".004",
            "teacher": "Ремінь А.В.",
            "type": "Лекция",
            "week": "all"
          },
          {
            "id": "431-А-fri-3-top",
            "pairNum": 3,
            "time": "16:40 - 18:00",
            "name": "Портові перевантажувальні машини",
            "room": ".005",
            "teacher": "Кокошко Є.М.",
            "type": "Лекция",
            "week": "all"
          }
        ]
      },
      {
        "id": "sat",
        "name": "Суббота",
        "lessons": []
      }
    ]
  }
}

export const GROUP_LIST = Object.values(COLLEGE_GROUPS).map(g => ({
  group: g.group,
  course: g.course,
  base: g.base,
  shift: g.shift,
  shiftName: g.shiftName,
  address: g.address,
  totalLessons: g.days.reduce((acc, d) => acc + d.lessons.length, 0)
})).sort((a, b) => {
  if (a.course !== b.course) return a.course - b.course
  return a.group.localeCompare(b.group)
})

export function getScheduleForGroup(groupName) {
  if (!groupName) return null
  const clean = groupName.trim()
  if (COLLEGE_GROUPS[clean]) return COLLEGE_GROUPS[clean]
  const found = Object.keys(COLLEGE_GROUPS).find(k => k.toLowerCase() === clean.toLowerCase())
  if (found) return COLLEGE_GROUPS[found]
  const withA = Object.keys(COLLEGE_GROUPS).find(k => k.toLowerCase() === (clean + '-а').toLowerCase())
  if (withA) return COLLEGE_GROUPS[withA]
  const withoutA = Object.keys(COLLEGE_GROUPS).find(k => k.replace(/-а$/i, '').toLowerCase() === clean.toLowerCase())
  if (withoutA) return COLLEGE_GROUPS[withoutA]
  return null
}

export function getCollegeWeekInfo(targetDate = new Date()) {
  const SEMESTER_START = new Date(2026, 7, 31, 0, 0, 0)
  const diffMs = targetDate.getTime() - SEMESTER_START.getTime()
  const diffDays = Math.floor(diffMs / (1000 * 60 * 60 * 24))
  let weekNum = Math.floor(diffDays / 7) + 1
  if (weekNum < 1) weekNum = 1
  const isSession = weekNum >= 17
  const isOdd = weekNum % 2 !== 0
  const weekType = isOdd ? 'odd' : 'even'
  const weekLabel = isOdd ? 'Числитель' : 'Знаменатель'
  return {
    weekNum,
    weekType,
    weekLabel,
    isSession
  }
}
